# DATA CLEANING ASSIGNMENT

In [152]:
import pandas as pd
import numpy as np

In [153]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN',
'londON_StockhOlm',

'Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
'12. Air France', '"Swiss Air"']})

In [154]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

# Question - 1

In [155]:
df['FlightNumber']

0    10045.0
1        NaN
2    10065.0
3        NaN
4    10085.0
Name: FlightNumber, dtype: float64

In [156]:
k=df['FlightNumber'].count()
k

3

In [157]:
for i in range(1,k+1):
    if(pd.isnull(df.loc[i,'FlightNumber'])):
        df.loc[i,'FlightNumber']=df.loc[i-1,'FlightNumber']+10

In [158]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN       10055.0            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis       10075.0          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [159]:
df['FlightNumber']=df['FlightNumber'].astype(int)

In [160]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris         10045      [23, 47]               KLM(!)
1      MAdrid_miLAN         10055            []    <Air France> (12)
2  londON_StockhOlm         10065  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis         10075          [13]       12. Air France
4   Brussels_londOn         10085      [67, 32]          "Swiss Air"

# QUESTION - 2

In [161]:
temp_df=df.copy()

In [162]:
temp_df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris         10045      [23, 47]               KLM(!)
1      MAdrid_miLAN         10055            []    <Air France> (12)
2  londON_StockhOlm         10065  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis         10075          [13]       12. Air France
4   Brussels_londOn         10085      [67, 32]          "Swiss Air"

In [163]:
temp_df[['From','To']]=temp_df.From_To.str.split("_",expand=True)

In [164]:
temp_df

,From_To,FlightNumber,RecentDelays,Airline,From,To
0,LoNDon_paris,10045,"[23, 47]",KLM(!),LoNDon,paris
1,MAdrid_miLAN,10055,[],<Air France> (12),MAdrid,miLAN
2,londON_StockhOlm,10065,"[24, 43, 87]",(British Airways. ),londON,StockhOlm
3,Budapest_PaRis,10075,[13],12. Air France,Budapest,PaRis
4,Brussels_londOn,10085,"[67, 32]","""Swiss Air""",Brussels,londOn

# QUESTION - 3

In [165]:
temp_df['From']=temp_df['From'].str.capitalize()

In [166]:
temp_df

,From_To,FlightNumber,RecentDelays,Airline,From,To
0,LoNDon_paris,10045,"[23, 47]",KLM(!),London,paris
1,MAdrid_miLAN,10055,[],<Air France> (12),Madrid,miLAN
2,londON_StockhOlm,10065,"[24, 43, 87]",(British Airways. ),London,StockhOlm
3,Budapest_PaRis,10075,[13],12. Air France,Budapest,PaRis
4,Brussels_londOn,10085,"[67, 32]","""Swiss Air""",Brussels,londOn

In [167]:
temp_df['To']=temp_df['To'].str.capitalize()

In [168]:
temp_df

,From_To,FlightNumber,RecentDelays,Airline,From,To
0,LoNDon_paris,10045,"[23, 47]",KLM(!),London,Paris
1,MAdrid_miLAN,10055,[],<Air France> (12),Madrid,Milan
2,londON_StockhOlm,10065,"[24, 43, 87]",(British Airways. ),London,Stockholm
3,Budapest_PaRis,10075,[13],12. Air France,Budapest,Paris
4,Brussels_londOn,10085,"[67, 32]","""Swiss Air""",Brussels,London

In [169]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris         10045      [23, 47]               KLM(!)
1      MAdrid_miLAN         10055            []    <Air France> (12)
2  londON_StockhOlm         10065  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis         10075          [13]       12. Air France
4   Brussels_londOn         10085      [67, 32]          "Swiss Air"

# QUESTION - 4

In [170]:
df.drop(columns=['From_To'],inplace=True)

In [171]:
df

   FlightNumber  RecentDelays              Airline
0         10045      [23, 47]               KLM(!)
1         10055            []    <Air France> (12)
2         10065  [24, 43, 87]  (British Airways. )
3         10075          [13]       12. Air France
4         10085      [67, 32]          "Swiss Air"

In [172]:
df['From']=temp_df['From']

In [173]:
df['To']=temp_df['To']

In [174]:
df

   FlightNumber  RecentDelays              Airline      From         To
0         10045      [23, 47]               KLM(!)    London      Paris
1         10055            []    <Air France> (12)    Madrid      Milan
2         10065  [24, 43, 87]  (British Airways. )    London  Stockholm
3         10075          [13]       12. Air France  Budapest      Paris
4         10085      [67, 32]          "Swiss Air"  Brussels     London

# QUESTION - 5

In [175]:
rows=[]
_=df.apply(lambda row:[rows.append([row['Airline'],row['FlightNumber'],nn,row['From'],row['To']]) for nn in row.RecentDelays],axis=1)

In [176]:
rows

[['KLM(!)', 10045, 23, 'London', 'Paris'],
 ['KLM(!)', 10045, 47, 'London', 'Paris'],
 ['(British Airways. )', 10065, 24, 'London', 'Stockholm'],
 ['(British Airways. )', 10065, 43, 'London', 'Stockholm'],
 ['(British Airways. )', 10065, 87, 'London', 'Stockholm'],
 ['12. Air France', 10075, 13, 'Budapest', 'Paris'],
 ['"Swiss Air"', 10085, 67, 'Brussels', 'London'],
 ['"Swiss Air"', 10085, 32, 'Brussels', 'London']]

In [177]:
df_modify=pd.DataFrame(rows,columns=df.columns)

In [178]:
df_modify

          FlightNumber  RecentDelays  Airline      From         To
0               KLM(!)         10045       23    London      Paris
1               KLM(!)         10045       47    London      Paris
2  (British Airways. )         10065       24    London  Stockholm
3  (British Airways. )         10065       43    London  Stockholm
4  (British Airways. )         10065       87    London  Stockholm
5       12. Air France         10075       13  Budapest      Paris
6          "Swiss Air"         10085       67  Brussels     London
7          "Swiss Air"         10085       32  Brussels     London

In [179]:
df2=pd.DataFrame(df['RecentDelays'].values.tolist())

In [180]:
df2

      0     1     2
0  23.0  47.0   NaN
1   NaN   NaN   NaN
2  24.0  43.0  87.0
3  13.0   NaN   NaN
4  67.0  32.0   NaN

In [181]:
length=df2.shape[1]

In [182]:
length

3

In [183]:
col_list=[]
col_dict={}
for i in range(length):
    key=df2.columns[i]
    value="Delay"+str(i+1)
    col_dict[key]=value
    
col_dict

{0: 'Delay1', 1: 'Delay2', 2: 'Delay3'}

In [184]:
df2.rename(columns=col_dict,inplace=True)

In [185]:
df2

   Delay1  Delay2  Delay3
0    23.0    47.0     NaN
1     NaN     NaN     NaN
2    24.0    43.0    87.0
3    13.0     NaN     NaN
4    67.0    32.0     NaN

In [186]:
df

   FlightNumber  RecentDelays              Airline      From         To
0         10045      [23, 47]               KLM(!)    London      Paris
1         10055            []    <Air France> (12)    Madrid      Milan
2         10065  [24, 43, 87]  (British Airways. )    London  Stockholm
3         10075          [13]       12. Air France  Budapest      Paris
4         10085      [67, 32]          "Swiss Air"  Brussels     London

In [187]:
df[['Delay1','Delay2','Delay3']]=df2[['Delay1','Delay2','Delay3']]

In [188]:
df

,FlightNumber,RecentDelays,Airline,From,To,Delay1,Delay2,Delay3
0,10045,"[23, 47]",KLM(!),London,Paris,23.0,47.0,NaN
1,10055,[],<Air France> (12),Madrid,Milan,NaN,NaN,NaN
2,10065,"[24, 43, 87]",(British Airways. ),London,Stockholm,24.0,43.0,87.0
3,10075,[13],12. Air France,Budapest,Paris,13.0,NaN,NaN
4,10085,"[67, 32]","""Swiss Air""",Brussels,London,67.0,32.0,NaN

In [189]:
df['Delays']=df['RecentDelays']

In [190]:
df.drop(columns='RecentDelays',inplace=True)

In [191]:
df

,FlightNumber,Airline,From,To,Delay1,Delay2,Delay3,Delays
0,10045,KLM(!),London,Paris,23.0,47.0,NaN,"[23, 47]"
1,10055,<Air France> (12),Madrid,Milan,NaN,NaN,NaN,[]
2,10065,(British Airways. ),London,Stockholm,24.0,43.0,87.0,"[24, 43, 87]"
3,10075,12. Air France,Budapest,Paris,13.0,NaN,NaN,[13]
4,10085,"""Swiss Air""",Brussels,London,67.0,32.0,NaN,"[67, 32]"